Repository: Cute-Satsuma/decibel_meter
Catalog: lib/l10n/app_*.arb
Languages: ar, bn, de, es, hi, ja, pt_br, ru, zh_cn

# appName
source: CS Decibel Meter
ar: CS مقياس الديسيبل
bn: CS ডেসিবেল মিটার
de: CS Dezibel-Messgerät
es: CS Medidor de Decibelios
hi: CS डेसिबल मीटर
ja: CS デシベルメーター
pt_br: CS Medidor de Decibéis
ru: CS Измеритель Децибел
zh_cn: CS 分贝仪

source: Decibel Meter
ar: مقياس الديسيبل
bn: ডেসিবেল মিটার
de: Dezibel-Messgerät
es: Medidor de Decibelios
hi: डेसिबल मीटर
ja: デシベルメーター
pt_br: Medidor de Decibéis
ru: Измеритель Децибел
zh_cn: 分贝仪

source: Current
ar: الحالي
bn: বর্তমান
de: Aktuell
es: Actual
hi: वर्तमान
ja: 現在
pt_br: Atual
ru: Текущий
zh_cn: 当前

# peak
source: Peak {value} dB
ar: الذروة {value} ديسيبل
bn: শীর্ষ {value} dB
de: Spitze {value} dB
es: Pico {value} dB
hi: शिखर {value} dB
ja: ピーク {value} dB
pt_br: Pico {value} dB
ru: Пик {value} дБ
zh_cn: 峰值 {value} dB

source: Measuring...
ar: جارٍ القياس...
bn: মাপা হচ্ছে...
de: Messen...
es: Midiendo...
hi: माप रहा है...
ja: 測定中...
pt_br: Medindo...
ru: Измерение...
zh_cn: 正在测量…

# tapToStart
source: Tap the button below to start measuring
ar: اضغط على الزر أدناه لبدء القياس
bn: মাপা শুরু করতে নীচের বোতামে ট্যাপ করুন
de: Tippen Sie auf die Schaltfläche unten, um mit der Messung zu beginnen
es: Toca el botón de abajo para comenzar a medir
hi: माप शुरू करने के लिए नीचे दिए गए बटन पर टैप करें
ja: 下のボタンをタップして測定を開始
pt_br: Toque no botão abaixo para começar a medir
ru: Нажмите кнопку ниже, чтобы начать измерение
zh_cn: 点击下方按钮开始测量

source: Start Measuring
ar: بدء القياس
bn: মাপা শুরু করুন
de: Messung Starten
es: Comenzar Medición
hi: माप शुरू करें
ja: 測定開始
pt_br: Iniciar Medição
ru: Начать Измерение
zh_cn: 开始测量

source: Stop
ar: إيقاف
bn: বন্ধ করুন
de: Stoppen
es: Detener
hi: रोकें
ja: 停止
pt_br: Parar
ru: Остановить
zh_cn: 停止

# permissionDenied
source: Please allow microphone access to measure ambient sound level
ar: يرجى السماح بالوصول إلى الميكروفون لقياس مستوى الصوت المحيط
bn: পরিবেশের শব্দের মাত্রা পরিমাপ করতে অনুগ্রহ করে মাইক্রোফোন অ্যাক্সেসের অনুমতি দিন
de: Bitte erlauben Sie den Mikrofonzugriff, um den Umgebungsschallpegel zu messen
es: Por favor permite el acceso al micrófono para medir el nivel de sonido ambiente
hi: परिवेश ध्वनि स्तर मापने के लिए कृपया माइक्रोफोन पहुंच की अनुमति दें
ja: 周囲の音レベルを測定するには、マイクへのアクセスを許可してください
pt_br: Por favor, permita o acesso ao microfone para medir o nível de som ambiente
ru: Пожалуйста, разрешите доступ к микрофону для измерения уровня окружающего звука
zh_cn: 请允许使用麦克风以测量环境音量

# micError
source: Unable to start microphone: {error}
ar: تعذر بدء تشغيل الميكروفون: {error}
bn: মাইক্রোফোন শুরু করতে অক্ষম: {error}
de: Mikrofon kann nicht gestartet werden: {error}
es: No se puede iniciar el micrófono: {error}
hi: माइक्रोफोन शुरू करने में असमर्थ: {error}
ja: マイクを開始できません: {error}
pt_br: Não foi possível iniciar o microfone: {error}
ru: Не удалось запустить микрофон: {error}
zh_cn: 无法启动麦克风: {error}

# average
source: Average: {value} dB
ar: المتوسط: {value} ديسيبل
bn: গড়: {value} dB
de: Durchschnitt: {value} dB
es: Promedio: {value} dB
hi: औसत: {value} dB
ja: 平均: {value} dB
pt_br: Média: {value} dB
ru: Среднее: {value} дБ
zh_cn: 平均值: {value} dB

source: Statistics
ar: الإحصائيات
bn: পরিসংখ্যান
de: Statistiken
es: Estadísticas
hi: आंकड़े
ja: 統計
pt_br: Estatísticas
ru: Статистика
zh_cn: 统计信息

# min
source: Min: {value} dB
ar: الحد الأدنى: {value} ديسيبل
bn: সর্বনিম্ন: {value} dB
es: Mín: {value} dB
hi: न्यूनतम: {value} dB
ja: 最小: {value} dB
pt_br: Mín: {value} dB
ru: Мин: {value} дБ
zh_cn: 最小值: {value} dB

source: Initializing...
ar: جارٍ التهيئة...
bn: আরম্ভ হচ্ছে...
de: Initialisierung...
es: Inicializando...
hi: आरंभ कर रहे हैं...
ja: 初期化中...
pt_br: Inicializando...
ru: Инициализация...
zh_cn: 初始化中...

# measurementInfo
source: Measurement Information
ar: معلومات القياس
bn: মাপার তথ্য
de: Messinformationen
es: Información de Medición
hi: माप जानकारी
ja: 測定情報
pt_br: Informações de Medição
ru: Информация об измерении
zh_cn: 测量说明

source: Measurement Rules
ar: قواعد القياس
bn: মাপার নিয়ম
de: Messregeln
es: Reglas de Medición
hi: माप नियम
ja: 測定ルール
pt_br: Regras de Medição
ru: Правила измерения
zh_cn: 测量规则

# measurementRulesContent
source: • Measurement starts 3 seconds after recording begins • This delay ensures accurate readings by allowing the microphone to stabilize • Statistics (min, average, percentiles) are calculated only after the initial 3-second period • Current decibel value is displayed in real-time throughout the measurement • For best results, keep the device steady during measurement
ar: • يبدأ القياس بعد 3 ثوانٍ من بدء التسجيل • يضمن هذا التأخير قراءات دقيقة من خلال السماح للميكروفون بالاستقرار • يتم حساب الإحصائيات (الحد الأدنى، المتوسط، النسب المئوية) فقط بعد الفترة الأولية البالغة 3 ثوانٍ • يتم عرض قيمة الديسيبل الحالية في الوقت الفعلي طوال عملية القياس • للحصول على أفضل النتائج، حافظ على ثبات الجهاز أثناء القياس
bn: • রেকর্ডিং শুরু হওয়ার 3 সেকেন্ড পরে মাপা শুরু হয় • এই বিলম্ব মাইক্রোফোনকে স্থিতিশীল করতে দিয়ে সঠিক রিডিং নিশ্চিত করে • পরিসংখ্যান (সর্বনিম্ন, গড়, পার্সেন্টাইল) শুধুমাত্র প্রাথমিক 3-সেকেন্ড সময়ের পরে গণনা করা হয় • বর্তমান ডেসিবেল মান পুরো মাপার সময় বাস্তব সময়ে প্রদর্শিত হয় • সেরা ফলাফলের জন্য, মাপার সময় ডিভাইস স্থির রাখুন
de: • Die Messung beginnt 3 Sekunden nach Beginn der Aufnahme • Diese Verzögerung gewährleistet genaue Messwerte, indem das Mikrofon Zeit zur Stabilisierung erhält • Statistiken (Min, Durchschnitt, Perzentile) werden nur nach der anfänglichen 3-Sekunden-Periode berechnet • Der aktuelle Dezibelwert wird während der gesamten Messung in Echtzeit angezeigt • Für beste Ergebnisse halten Sie das Gerät während der Messung ruhig
es: • La medición comienza 3 segundos después de iniciar la grabación • Este retraso asegura lecturas precisas permitiendo que el micrófono se estabilice • Las estadísticas (mín, promedio, percentiles) se calculan solo después del período inicial de 3 segundos • El valor de decibelios actual se muestra en tiempo real durante toda la medición • Para mejores resultados, mantenga el dispositivo estable durante la medición
hi: • रिकॉर्डिंग शुरू होने के 3 सेकंड बाद माप शुरू होता है • यह देरी माइक्रोफोन को स्थिर करने की अनुमति देकर सटीक रीडिंग सुनिश्चित करती है • आंकड़े (न्यूनतम, औसत, प्रतिशत) केवल प्रारंभिक 3-सेकंड अवधि के बाद गणना की जाती है • वर्तमान डेसिबल मान पूरे माप के दौरान वास्तविक समय में प्रदर्शित होता है • सर्वोत्तम परिणामों के लिए, माप के दौरान डिवाइस को स्थिर रखें
ja: • 録音開始から3秒後に測定を開始します • この遅延により、マイクが安定し、正確な測定値が得られます • 統計情報（最小値、平均値、パーセンタイル）は初期3秒間の後でのみ計算されます • 現在のデシベル値は測定全体を通じてリアルタイムで表示されます • 最良の結果を得るには、測定中はデバイスを安定させてください
pt_br: • A medição começa 3 segundos após o início da gravação • Este atraso garante leituras precisas permitindo que o microfone se estabilize • As estatísticas (mín, média, percentis) são calculadas apenas após o período inicial de 3 segundos • O valor de decibéis atual é exibido em tempo real durante toda a medição • Para melhores resultados, mantenha o dispositivo estável durante a medição
ru: • Измерение начинается через 3 секунды после начала записи • Эта задержка обеспечивает точные показания, позволяя микрофону стабилизироваться • Статистика (мин, среднее, процентили) рассчитывается только после начального 3-секундного периода • Текущее значение децибел отображается в реальном времени на протяжении всего измерения • Для лучших результатов держите устройство неподвижно во время измерения
zh_cn: • 录音开始3秒后才开始正式测量 • 此延迟确保麦克风稳定，获得准确读数 • 统计信息（最小值、平均值、百分位值）仅在3秒延迟后计算 • 当前分贝值在整个测量过程中实时显示 • 为获得最佳结果，测量时请保持设备稳定

source: History
es: Historial

source: No history records
es: No hay registros históricos

source: Delete Record
es: Eliminar Registro

# deleteRecordConfirm
source: Are you sure you want to delete this record?
es: ¿Está seguro de que desea eliminar este registro?

source: Delete All Records
es: Eliminar Todos los Registros

# deleteAllRecordsConfirm
source: Are you sure you want to delete all records? This action cannot be undone.
es: ¿Está seguro de que desea eliminar todos los registros? Esta acción no se puede deshacer.

source: Record deleted
es: Registro eliminado

source: All records deleted
es: Todos los registros eliminados

source: Cancel
es: Cancelar

source: Delete
es: Eliminar

# percentile
source: P{percentile}: {value} dB
ar: P{percentile}: {value} ديسيبل
ru: P{percentile}: {value} дБ
